app/controllers/authentication_controller.rb

SELECT * FROM `users` WHERE (`users`.`name` = 'admin') LIMIT 1
---
  def login
    if request.get?
      session[:user_id] = nil
    else
      # Try to get the user with the supplied username and password
      logged_in_user = User.login(params[:user][:name], params[:login][:password])

      # Create the session and redirect
      unless logged_in_user.blank?