app/controllers/file_controller.rb

  def download
    # Log the 'usage' and return the file.
    usage = Usage.new
    usage.download_date_time = Time.now
    usage.user = @logged_in_user
    usage.myfile = @myfile

    if usage.save
---
INSERT INTO `usages` (`myfile_id`, `download_date_time`, `user_id`) VALUES(1, '2010-07-15 16:57:57', 1)

  def do_the_upload # now with multiple file upload
    counter = 0
    while(params["file_#{counter}".to_s] != "") # the first file is params[:file_0]
	    @myfile = Myfile.new()
	    @myfile.myfile = params["file_#{counter}".to_s] # Myfile.myfile contains the actual data
	    @myfile.folder_id = folder_id
	    @myfile.date_modified = Time.now
	    @myfile.user = @logged_in_user
	    @myfile.description = params[:description]

	    # change the filename if it already exists
	    if USE_UPLOAD_PROGRESS and not Myfile.find_by_filename_and_folder_id(@myfile.filename, folder_id).blank?
	      @myfile.filename = @myfile.filename + ' (' + Time.now.strftime('%Y%m%d%H%M%S') + ')'
	    end

	    if @myfile.save
---
SELECT `myfiles`.id FROM `myfiles` WHERE (`myfiles`.`filename` = BINARY 'Winter.jpg' AND `myfiles`.folder_id = 1) LIMIT 1
INSERT INTO `myfiles` (`date_modified`, `folder_id`, `description`, `indexed`, `filename`, `filesize`, `user_id`) VALUES('2010-07-15 16:56:18', 1, 'pic', 0, 'Winter.jpg', 105, 1)

  def destroy
    @myfile.destroy
---
DELETE FROM `myfiles` WHERE `id` = 1