app/controllers/folder_controller.rb

SELECT * FROM `folders` WHERE (`folders`.parent_id = 1) ORDER BY name, name
---
  def list
    # Get the folder
    #folder_id = 1
    @folder = Folder.find_by_id(folder_id)

SELECT * FROM `users` WHERE (`users`.`rss_access_key` = 'JyA3hBMWryOev8MhfzGfjIC41JOifHxZqw4u') LIMIT 1
SELECT * FROM `folders` WHERE (`folders`.parent_id = 1) ORDER BY name, name
---
  def feed
    # check for valid access key:
    user = User.find_by_rss_access_key(params[:access_key])
    @authorized = !user.blank?

    # get the folder
    @folder = Folder.find_by_id(folder_id)

INSERT INTO `folders` (`name`, `date_modified`, `is_root`, `user_id`, `parent_id`) VALUES('arvind', '2010-07-15 16:55:58', 0, 1, 1)
---
  def create
    if request.post?
      @folder = Folder.new(params[:folder])
      @folder.parent_id = folder_id
      @folder.date_modified = Time.now
      @folder.user = @logged_in_user

      if @folder.save