app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def list
    @users = User.find(:all, :order => 'name')

INSERT INTO `users` (`name`, `hashed_password`, `is_the_administrator`, `password_salt`, `rss_access_key`, `email`) VALUES('arvind', '300d68820b6cf8397c09976466c72ca6c1f65afb', 0, 'fo71TB', 'JyA3hBMWryOev8MhfzGfjIC41JOifHxZqw4u', 'apjanvekar@gmail.com')
---
  def create
    if request.post?
      @user = User.new(params[:user])
      @user.password_required = true

      # add the user to the selected groups
      add_user_to_groups(@user, params[:belongs_to_group])

      if @user.save